# Taps

tap "abhimanyu003/sttr"
tap "anomalyco/tap"
tap "charmbracelet/tap"
tap "dcchambers/tap"
tap "googlecontainertools/kpt"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "manaflow-ai/cmux"
tap "tarkah/tickrs"
tap "teamookla/speedtest"
tap "tinygo-org/tools"

# Brew Formula

brew "age"
brew "achannarasappa/tap/ticker"
brew "anomalyco/tap/opencode"
brew "asciinema"
brew "atuin"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bat-extras"
brew "chrome-cli"
brew "crystal"
brew "dcchambers/tap/notekeeper" #
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "fx"                        # TUI Json viewer
brew "gifski"                    # Gif encoder
brew "gist"
brew "git"
brew "git-delta"                 # Better git diff output
brew "gh"                        # https://cli.github.com/
brew "gnu-sed"
brew "go"
brew "gojq"
brew "goto"
brew "gpg"
brew "httpie"
brew "jaq"                       # jq with extra features
brew "jqp"
brew "lazydocker"
brew "lazygit"
brew "libyaml          "         # ruby-build dependency
brew "lnav"                      # log viewing tool - https://lnav.org/
brew "m-cli"
brew "mas"
brew "mise"
brew "neovim"
brew "numbat"
brew "nushell"
brew "onefetch"
brew "pandoc"
brew "pass"                      # https://www.passwordstore.org/
brew "python"                    # TODO - Use mise instead to manage python install
brew "ripgrep"
brew "rga"                       # https://github.com/phiresky/ripgrep-all
brew "ruby-build"
brew "rustup-init"
brew "scc"                       # like cloc
brew "shellcheck"
brew "silicon"
brew "slides"
brew "sqlite"
brew "sttr"
brew "tarkah/tickrs/tickrs"
brew "teamookla/speedtest/speedtest"
brew "tinygo-org/tools/tinygo"
brew "tlrc"                      # tldr in Rust
brew "tree"
brew "tty-clock"
brew "watchman"
brew "yt-dlp"
brew "yq"
brew "zoxide"                    # See also: https://github.com/rupa/z

# Casks (Graphical .app programs)

## Books/E-Readers
cask "remarkable"

## Calendar
cask "itsycal"

## MacOS Productivity
cask "1password"
cask "1password-cli"
cask "command-x"
cask "jordanbaird-ice"
cask "raycast"
cask "rectangle"
cask "silicon-app"
cask "shortcat"
cask "trex"

## Markdown, Notes & PKM
cask "heynote"
cask "mark-text"
cask "notion"
cask "obsidian"

## Media
cask "iina"
cask "netnewswire"
cask "vlc"

## Programming
### APIs
cask "httpie"
cask "rapidapi"

### Containers/Kubernetes
cask "orbstack"                      # https://orbstack.dev/

### Database
cask "db-browser-for-sqlite"
cask "postgres-unofficial"           # https://postgresapp.com/

### Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nerd-font"

### Hex Editors/Reverse Engineering
cask "cutter"
cask "imhex"
# See also: rizin, hexyl

### IDEs/Text Editors
cask "visual-studio-code"
cask "zed"
cask "zed@preview"

### Terminal
cask "ghostty"

##  Messaging
cask "discord"
cask "hey-desktop"
cask "whatsapp"

## Productivity
cask "ticktick"
cask "tomatobar"

## Web
cask "firefox"
cask "google-chrome"
cask "orion"

## To-be categorized
cask "anki"
cask "basictex"
cask "espanso"       # https://espanso.org/
cask "gitify"
cask "inkscape"
cask "ollama"        # Provides a GUI app to install/manage the ollama cli
cask "manaflow-ai/cmux/cmux"
cask "maestral"      # dropbox client
cask "setapp"        # See setapp.txt
cask "steam"
cask "steamcmd"
cask "tailscale-app"

# Cargo Crates (Rust package manager)

cargo "htmlq"
cargo "difftastic"
