# Taps
tap "abhimanyu003/sttr"
tap "achannarasappa/tap"
tap "ankitpokhrel/jira-cli"
tap "charmbracelet/tap"
tap "chef/chef"
tap "cooklang/tap"
tap "cue-lang/tap"
tap "dcchambers/tap"
tap "eth-p/software"
tap "fermyon/tap"
tap "googlecontainertools/kpt"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homeport/tap"
tap "noahgorstein/tap"
tap "tarkah/tickrs"
tap "teamookla/speedtest"
tap "tinygo-org/tools"
tap "vmware-tanzu/carvel"

# Brew Formula (CLI tools)
brew "act"
brew "age"
brew "achannarasappa/tap/ticker"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "asciinema"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "borgbackup"
brew "borgmatic"
brew "charmbracelet/tap/skate"
brew "chrome-cli"
brew "cooklang/tap/cook"
brew "crane" # https://github.com/google/go-containerregistry/blob/main/cmd/crane/README.md
brew "crystal"
brew "cue-lang/tap/cue"
brew "dark-mode"
brew "darksky-weather"
brew "dcchambers/tap/cbonsai"
brew "dcchambers/tap/kubeval"
brew "dcchambers/tap/writeas-cli"
brew "dhall-json"
brew "dog"
brew "duf"
brew "eth-p/software/bat-extras"
brew "eza"
brew "fermyon/tap/spin"
brew "ffmpeg"
brew "ffsend"
brew "fish"
brew "fzf"
brew "fx"
brew "gifski"
brew "gist"
brew "git"
brew "git-delta"
brew "gh"
brew "glow"
brew "go"
brew "golangci-lint"
brew "go-jsonnet"
brew "gojq"
brew "googler"
brew "goto"
brew "gpg"
brew "gron"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"
brew "helix"
brew "helm"
brew "heroku/brew/heroku"
brew "hexyl"
brew "homeport/tap/dyff"
brew "httpie"
brew "jaq"
brew "jless"
brew "joplin-cli"
brew "jq"
brew "jql"
brew "k9s"
brew "kapp" # vmware-tanzu/carvel/kapp
brew "kpt" # googlecontainertools/kpt/kpt
brew "kubectx"
brew "kubernetes-cli" #Minikube dependency, but useful to list still
brew "kubie"
brew "kustomize"
brew "krew"
brew "lastpass-cli"
brew "lazydocker"
brew "lazygit"
brew "libyaml" # needed for rbenv/ruby-build
brew "lnav"
brew "lynx"
brew "m-cli"
brew "mas"
brew "micro"
brew "minikube"
brew "mise"
brew "mkcert"
brew "most"
brew "neofetch"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "nnn"
brew "noahgorstein/tap/jqp"
brew "node"
brew "notekeeper"
brew "numbat"
brew "nushell"
brew "onefetch"
brew "openjdk"
brew "pandoc"
brew "pass"
brew "plantuml"
brew "podman"
brew "prettyping"
brew "python"
brew "ranger"
brew "rbenv"
brew "rbenv-vars"
brew "redo"
brew "ripgrep"
brew "rizin"
brew "rga"
brew "ruby-build"
#brew "rust" # Install with rustup instead.
brew "rustup-init"
brew "saml2aws"
brew "scc"
brew "shellcheck"
brew "silicon"
brew "slides"
brew "speedtest" # Official Ookla speedtest
brew "speedtest-cli" # From github.com/sivel/speedtest-cli
brew "sqlite"
brew "sshuttle"
brew "sttr"
brew "tarkah/tickrs/tickrs"
brew "task"
brew "tealdeer" # tldr.sh rust implementation
brew "terminal-notifier"
brew "tinygo-org/tools/tinygo"
brew "tmux"
brew "timewarrior"
brew "transmission-cli"
brew "tree"
brew "tty-clock"
brew "vim"
brew "vendir"
brew "watson"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "yt-dlp"
brew "yq"
brew "zellij"
brew "zoxide" # See also: https://github.com/rupa/z

# Casks (Graphical .app programs)

## Audio
#cask "background-music"
cask "eqmac"
cask "soundsource"

## Books/E-Readers
cask "calibre"
cask "remarkable"

## Calculator
cask "numi"
#cask "parsify"
#cask "soulver"

## Calendar
cask "itsycal"

## MacOS Productivity
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "command-x"
cask "flux"
cask "lunar"
cask "only-switch"
cask "raycast"
cask "rectangle"
cask "silicon"
cask "shortcat"
cask "trex"

## Markdown, Notes & PKM
cask "joplin"
cask "macdown"
cask "mark-text"
cask "marked"
cask "notable"
cask "notion"
cask "obsidian"
cask "typora"

## Media
cask "iina"
cask "netnewswire"
cask "transmission"
cask "vlc"

## Programming
### APIs
cask "httpie"
cask "insomnia"
cask "postman"
cask "rapidapi"

### Containers/Kubernetes
cask "docker"
#cask "rancher" # Conflicts with existing k8s stuff.

### Database
cask "db-browser-for-sqlite"
cask "postgres-unofficial" # https://postgresapp.com/

### Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nerd-font"

### Hex Editors/Reverse Engineering
cask "cutter"
cask "imhex"
# See also: rizin, hexyl

### IDEs/Text Editors
cask "nova" # Trial
cask "textbuddy" # Trial. Purchase --> https://retina.studio/
cask "visual-studio-code"
cask "zed"

### Messaging
cask "discord"
cask "hey"
cask "whatsapp"

### Misc
cask "chefdk"
cask "dash"
cask "gitify"
cask "google-cloud-sdk"

cask "jordanbaird-ice"
cask "vagrant"

### Productivity
cask "ticktick"

## Screen Recording
cask "cap"
cask "flameshot"
cask "kap"
cask "obs"

## Terminal
cask "alacritty"
cask "ghostty"
cask "wezterm"

## Web
cask "fastmarks" # Trial. Purchase --> https://retina.studio/
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "orion"

## To-be categorized
cask "anki"
cask "basictex"
cask "heynotes"
cask "inkscape"
cask "ollama" # Provides a GUI app to install/manage the ollama cli
#cask "keybase"
cask "krita"
cask "lm-studio"
cask "maestral" # dropbox client
cask "postgres-unofficial"
cask "private-internet-access"
cask "setapp" # See setapp.txt
cask "steam"
cask "steamcmd"
cask "tailscale"
cask "tomatobar"
