# Taps
tap "abhimanyu003/sttr"
tap "charmbracelet/tap"
tap "chef/chef"
tap "cue-lang/tap"
tap "dcchambers/tap"
tap "eth-p/software"
tap "googlecontainertools/kpt"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homeport/tap"
tap "instrumenta/instrumenta"
tap "kovetskiy/mark"
tap "noahgorstein/tap"
tap "teamookla/speedtest"
tap "vmware-tanzu/carvel"

# Brew Formula (CLI tools)
brew "act"
brew "age"
brew "asciinema"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "charmbracelet/tap/skate"
brew "chrome-cli"
brew "crystal"
brew "cue-lang/tap/cue"
brew "dark-mode"
brew "darksky-weather"
brew "dcchambers/tap/cbonsai"
brew "dcchambers/tap/kubeval"
brew "dcchambers/tap/writeas-cli"
brew "dhall-json"
brew "dog"
brew "duf"
brew "eth-p/software/bat-extras"
brew "exa"
brew "ffmpeg"
brew "ffsend"
brew "fish"
brew "fzf"
brew "gifski"
brew "gist"
brew "git"
brew "gh"
brew "glow"
brew "go"
brew "golangci-lint"
brew "go-jsonnet"
brew "gojq"
brew "googler"
brew "goto"
brew "gpg"
brew "gron"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"
brew "helm"
brew "heroku/brew/heroku"
brew "homeport/tap/dyff"
brew "httpie"
brew "hub"
#brew "instrumenta/instrumenta/kubeval" #Using dcchambers/tap/kubeval for now.
brew "jless"
brew "joplin-cli"
brew "jq"
#brew "jsonnet" #Conflicts with go-jsonnet
brew "k9s"
brew "kapp" # vmware-tanzu/carvel/kapp
brew "kpt" # googlecontainertools/kpt/kpt
brew "kubernetes-cli" #Minikube dependency, but useful to list still
brew "kubie"
brew "krew"
brew "lastpass-cli"
brew "lnav"
brew "lynx"
brew "mark" # kovetskiy/mark
brew "mas"
brew "micro"
brew "minikube"
brew "mkcert"
brew "most"
brew "neofetch"
brew "newsboat"
brew "nmap"
brew "nnn"
brew "noahgorstein/tap/jqp"
brew "node"
brew "notekeeper"
brew "onefetch"
brew "openjdk"
brew "pandoc"
brew "pass"
brew "plantuml"
brew "podman"
brew "prettyping"
brew "python"
brew "ranger"
brew "rbenv"
brew "rbenv-vars"
brew "redo"
brew "ripgrep"
brew "rga"
brew "ruby-build"
#brew "rust" #Let's try just using rustup.
brew "rustup-init"
brew "saml2aws"
brew "shellcheck"
brew "silicon"
brew "slides"
brew "speedtest" #Official Ookla speedtest
brew "speedtest-cli" #From github.com/sivel/speedtest-cli
brew "sqlite"
brew "sshuttle"
brew "sttr"
brew "task"
brew "tealdeer" #tldr.sh rust implementation
brew "terminal-notifier"
brew "tmux"
brew "timewarrior"
brew "transmission-cli"
brew "tree"
brew "tty-clock"
brew "vim"
brew "vendir"
brew "watson"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "yq"

# Casks (Graphical .app programs)

## Books/E-Readers
cask "calibre"
cask "remarkable"

## Calculator
cask "numi"
#cask "parsify"
#cask "soulver"

## Calendar
cask "itsycal"

## MacOS Productivity
#cask "alfred"
cask "background-music"
cask "flux"
cask "lunar"
#cask "raycast"
cask "rectangle"
cask "silicon"

## Markdown, Notes & PKM
cask "joplin"
cask "logseq"
cask "macdown"
cask "mark-text"
cask "notable"
cask "notion"
cask "obsidian"
cask "typora"

## Media
cask "transmission"
cask "vlc"

## Programming
### APIs
cask "httpie"
cask "insomnia"
cask "postman"
cask "rapidapi"

### Containers/Kubernetes
cask "docker"
#cask "rancher" #Conflicts with existing k8s stuff.

### Database
cask "db-browser-for-sqlite"

### IDEs/Text Editors
cask "nova" #trial
cask "textbuddy" #Trial. Purchase --> https://retina.studio/
cask "visual-studio-code"

### Misc
cask "chefdk"
cask "gitify"
cask "google-cloud-sdk"
cask "vagrant"

## Screen Recording
cask "kap"
cask "obs"

## Web
cask "fastmarks" #Trial. Purchase --> https://retina.studio/
cask "firefox"
cask "firefox-developer-edition"
cask "firefox-nightly"
#cask "google-chrome" #Moved to personal.Brewfile
cask "google-chrome-canary"

## To-be categorized
cask "basictex"
cask "inkscape"
#cask "keybase
cask "maestral" #dropbox client
#cask "zoom" #Managed by IT dept

# Mac App Store (via mas)
mas "Noteship", id: 1571711347
