# Brewfile for stuff I only want on my personal laptop.
# Install with: brew bundle install --file Brewfile.personal

# Taps
tap "achannarasappa/tap"
tap "tarkah/tickrs"
tap "cooklang/tap"

# Formulae
brew "achannarasappa/tap/ticker"
brew "borgbackup"
brew "borgmatic"
brew "cooklang/tap/cook"
brew "kubectx"
brew "tarkah/tickrs/tickrs"

# Casks
cask "discord"
cask "google-chrome"
cask "heynotes"
cask "inkscape"
cask "ollama" #NOTE: do not use ollama formula if using the ollama cask. Cask provides a GUI app to install/manage the CLI.
cask "postgres-unofficial"
cask "private-internet-access"
cask "krita"
cask "setapp" #See setapp.txt for list of apps installed via setapp.
cask "steam"
cask "steamcmd"
cask "whatsapp"
cask "zoom"
